"""Написать функцию, которая принимает строку с разделенными дефисом словами и возвращает эту же строку со словами
 отсортированными в алфавитном порядке. Например, строка “green-red-yellow-black-white” должна быть преобразована в
  строку “black-green-red-white-yellow”."""

l = ['green-red-yellow-black-white']


def sort():
    pass


l1 = l.replace('-', ' ')
print(l1)
# '|->'.join(['a12', '1b2', 'c12'])