"""Создать класс “Треугольник”, свойства - координаты 3-х точек. Предусмотреть в классе методы проверки существования
 треугольника, вычисления и вывода сведений о фигуре - длины сторон, углы, периметр, площадь. Создать производный класс
  “Равнобедренный треугольник”, предусмотреть в классе проверку, является ли треугольник равносторонним. Написать
   программу, демонстрирующую работу с классами: дано N треугольников и M равнобедренных треугольников, вывести номера
    треугольников с одинаковой площадью и равнобедренный треугольник с наименьшей медианой.
"""