"""Создать класс “Прямоугольник”, свойства - длины сторон, методы - вычисление и вывод сведений о фигуре - длины сторон,
 диагонали, периметр, площадь. Создать класс “Треугольник”, свойства - длины сторон, методы - вычисление и вывод
  сведений о фигуре - длины сторон, периметр, площадь. Создать производный от них класс “Прямоугольная пирамида
   с прямоугольником в основании”, свойства - длины сторон основания и высота, метод - вычисление объема пирамиды.
    Написать программу, демонстрирующую работу с классом: дано L прямоугольников, M треугольников, N прямоугольных
    пирамид с прямоугольником в основании, найти три прямоугольника с наименьшей площадью, все прямоугольные
     треугольники и все пирамиды, объем которых отличается от среднего объема не более, чем на 10%.
"""