"""Напишите программу для расчета факториала числа N, т.е. произведения всех чисел от 1 до N включительно.
"""
n = int(input("Введите число N -> "))
b = 1
fac: int = 1
while n > 1:
   fac *= n
   n -= 1
   b += 1
print("Факториал числа ", b, " равен ", fac)

